.config/emacs/config.org
#+title: GNU Emacs Configuration
#+auto_tangle: t

* Table of Contents :toc:noexport:
- [[#info-and-credits][INFO and CREDITS]]
- [[#early-init][Early Init]]
- [[#the-rest][The rest]]
  - [[#sane-defaults-and-other][Sane defaults (and other)]]
    - [[#termux-check][Termux check]]
    - [[#some-modes-turned-on-and-off][Some modes turned on and off]]
    - [[#uncluttering-user-emacs-directory][Uncluttering user-emacs-directory]]
    - [[#other-variables][Other variables]]
    - [[#other][Other]]
    - [[#package-management-setup][Package management setup]]
      - [[#normal-packages][Normal packages]]
      - [[#not-normal-packages-vc][Not normal packages (vc)]]
  - [[#keybindings][Keybindings]]
    - [[#modal-editing-meow][Modal editing (Meow)]]
    - [[#flashing][Flashing]]
    - [[#setting-keybindings][Setting keybindings]]
  - [[#built-in-packages][Built-in packages]]
    - [[#abbreviations][Abbreviations]]
    - [[#file-history][File history]]
    - [[#remembering-file-place][Remembering file place]]
    - [[#eww][EWW]]
    - [[#line-numbers][Line numbers]]
    - [[#project-management][Project management]]
    - [[#tabs][Tabs]]
    - [[#ibuffer][Ibuffer]]
  - [[#appearance][Appearance]]
    - [[#dashboard][Dashboard]]
    - [[#fonts][Fonts]]
      - [[#setting-fonts][Setting fonts]]
      - [[#enabling-programming-ligatures][Enabling programming ligatures]]
      - [[#mixed-pitch][Mixed Pitch]]
    - [[#highlight-todo][Highlight TODO]]
    - [[#icons][Icons]]
      - [[#all-the-icons][ALL THE ICONS]]
      - [[#nerd-icons][NERD ICONS]]
    - [[#modeline][Modeline]]
    - [[#rainbow-delimiters][Rainbow delimiters]]
    - [[#dispaly-color-codes][Dispaly color codes]]
    - [[#theme][Theme]]
  - [[#completion][Completion]]
    - [[#in-buffer-completion-corfu][In-buffer completion (corfu)]]
    - [[#minibuffer-completion-vertico-with-consult][Minibuffer completion (vertico with consult)]]
      - [[#vertico][Vertico]]
      - [[#consult][Consult]]
      - [[#annotations-marginalia][Annotations (marginalia)]]
  - [[#dired][Dired]]
    - [[#dired-1][Dired]]
    - [[#dirvish][Dirvish]]
  - [[#docs][Docs]]
    - [[#helpful][Helpful]]
    - [[#which-key][Which-key]]
  - [[#elfeed][Elfeed]]
  - [[#magit][Magit]]
  - [[#org-mode][Org Mode]]
    - [[#initial-tweaks][Initial tweaks]]
    - [[#org-tempo][Org Tempo]]
    - [[#org-appear][Org appear]]
    - [[#org-auto-tangle][Org auto tangle]]
    - [[#org-roam][Org Roam]]
    - [[#org-yt][Org yt]]
    - [[#sliced-images][Sliced images]]
    - [[#toc][TOC]]
  - [[#parenthesis][Parenthesis]]
  - [[#programming][Programming]]
    - [[#compiling][Compiling]]
    - [[#flycheck][Flycheck]]
    - [[#lsp][LSP]]
    - [[#language-support][Language support]]
    - [[#languages][Languages]]
      - [[#shells][Shells]]
      - [[#c][C++]]
      - [[#elisp][Elisp]]
      - [[#python][Python]]
      - [[#web][Web]]
    - [[#lorem-ipsum-generator][Lorem ipsum generator]]
    - [[#tree-sitter][Tree-sitter]]
    - [[#templates][Templates]]
      - [[#startup-templates][Startup templates]]
      - [[#command-templates][Command templates]]
  - [[#shells-and-terminals][Shells and terminals]]
    - [[#shell][Shell]]
    - [[#eshell][Eshell]]
      - [[#eat][EAT]]
    - [[#vterm][Vterm]]
  - [[#sudo-edit][Sudo edit]]
  - [[#translation-reverso][Translation (reverso)]]
  - [[#windowbuffer-management][Window/buffer management]]
    - [[#buffer-move][Buffer-move]]
  - [[#writeroom][Writeroom]]
  - [[#display-buffer-alist][display-buffer-alist]]
  - [[#m3u-mode][M3U mode]]

* INFO and CREDITS
Credits to:
- DistroTube with his [[https://youtube.com/playlist?list=PL5--8gKSku15e8lXf7aLICFmAHQVo0KXX][Emacs Configuration videos]]
- System Crafters with his Emacs from Scratch [[https://youtube.com/playlist?list=PLEoMzSkcN8oPH1au7H6B7bBJ4ZO7BXjSZ][videos]] and [[https://systemcrafters.net/emacs-from-scratch/][web articles]]
- [[https://sachachua.com/blog/][Sacha Chua]] for giving sum of Emacs news and content per week

This config is used on Emacs _29.4_ and is intended for use with that version.
* Early Init
#+begin_src emacs-lisp :tangle ./early-init.el
(setq frame-inhibit-implied-resize t ;; that makes startup slightly faster
      gc-cons-threshold most-positive-fixnum)

;; Faster to disable these here (before they've been initialized)
(push '(menu-bar-lines . 0) default-frame-alist)
(push '(tool-bar-lines . 0) default-frame-alist)
(push '(vertical-scroll-bars) default-frame-alist)
#+end_src
* The rest
#+PROPERTY: header-args :tangle init.el
** Sane defaults (and other)
Here are some tweaks that idk where to put.
*** Termux check
I'll disable some stuff for Termux specifically so I create a function that checks if I'm on Termux.
#+begin_src emacs-lisp
(defun custom/termux-p ()
  "Checks if Emacs is running inside of Termux."
  (and (getenv "TERMUX_VERSION")))
#+end_src
*** Some modes turned on and off
Those =fbound= are because Termux Emacs doesn't have some functions at all and that spitted out errors.
#+begin_src emacs-lisp
(unless (custom/termux-p)
  (if (fboundp 'scroll-bar-mode)
      (scroll-bar-mode -1)))         ; Disable visible scrollbar
(unless (custom/termux-p)
  (if (fboundp 'tool-bar-mode)
      (tool-bar-mode -1)))           ; Disable the toolbar
(unless (custom/termux-p)
  (if (fboundp 'set-fringe-mode)
      (set-fringe-mode 10)))       ; Give some breathing room
(tooltip-mode -1)                    ; Disable tooltips
(menu-bar-mode -1)                   ; Disable the menu bar
(global-auto-revert-mode t)          ; Automatically show changes if the file has changed
(global-visual-line-mode t)          ; Enable truncated lines (line wrapping)
(delete-selection-mode 1)            ; You can select text and delete it by typing (in emacs keybindings).
(electric-pair-mode 0)               ; Turns off automatic parens pairing
(electric-indent-mode -1)            ; Turn off the weird default indenting.
(column-number-mode 1)               ; Column number in modeline
(display-battery-mode 1)             ; Setting battery percentage in modeline
#+end_src
*** Uncluttering user-emacs-directory
#+begin_src emacs-lisp
(defvar custom/user-share-emacs-directory "~/.local/share/emacs/"
  "Directory to redirect cache/dump files.
Elisp packages cache folders/files normally clutter `user-emacs-directory'.
The same goes for some default files like bookmarks file.
In order to prevent that this variable exists.
Most of the stuff will get redirected here.")

(setq-default bookmark-default-file (expand-file-name "bookmarks" custom/user-share-emacs-directory) ; bookmarks file put somewhere else
              auto-save-list-file-prefix (expand-file-name "auto-save-list/.saves-" custom/user-share-emacs-directory)
              ;; prescient-save-file (expand-file-name "var/prescient-save.el" custom/user-share-emacs-directory)
              custom-file (expand-file-name "custom.el" custom/user-share-emacs-directory) ; custom settings that emacs autosets put into it's own file
              backup-directory-alist '((".*" . "~/.local/share/Trash/files")) ; moving backup files to trash directory
              tramp-persistency-file-name (expand-file-name "tramp" custom/user-share-emacs-directory) ; tramp file put somewhere else
              save-place-file (expand-file-name "places" custom/user-share-emacs-directory)
              url-configuration-directory (expand-file-name "url" custom/user-share-emacs-directory) ; cache from urls (eww)
              multisession-directory (expand-file-name "multisession" custom/user-share-emacs-directory)
              transient-history-file (expand-file-name "transient/history.el" custom/user-share-emacs-directory)
              request-storage-directory (expand-file-name "request" custom/user-share-emacs-directory))
#+end_src
*** Other variables
#+begin_src emacs-lisp
(setq-default visible-bell nil ;; Set up the visible bell
              global-auto-revert-non-file-buffers t ; refreshing buffers when files have changed
              use-dialog-box nil ; turns off graphical dialog boxes
              use-file-dialog nil
              initial-buffer-choice t ; scratch buffer is the buffer to show at the startup
              initial-major-mode 'fundamental-mode ; setting scratch buffer in `fundamental-mode'
              initial-scratch-message nil ; scratch buffer message
              inhibit-startup-message nil ; default emacs startup message
              scroll-conservatively 1000 ; Scroll one line at a time
              scroll-margin 1 ; Keep a margin of 1 line when scrolling at the window's edge
              vc-follow-symlinks t ; Enable follow symlinks
              indent-tabs-mode nil ; use spaces instead of tabs for indenting
              tab-width 4 ; it's set by default to 8
              ;; standard-indent 2 ; indenting set to 2
              auto-revert-interval 1
              use-short-answers t ; replace yes-no prompts with y-n
              fast-but-imprecise-scrolling t ; fast scrolling
              inhibit-compacting-font-caches t
              sentence-end-double-space nil ; sentences end with 1 space
              create-lockfiles nil ; no files wiht ".#"
              require-final-newline t)

;; showing init time in scratch buffer
(add-hook 'after-init-hook (lambda () (setq initial-scratch-message (concat "Initialization time: " (emacs-init-time)))))

;; this opens links in android's default apps in termux
(if (custom/termux-p)
    (setq browse-url-browser-function 'browse-url-xdg-open))
#+end_src
