.config/emacs/config.org
*** Abbreviations
Built-in =abbrev-mode= allows for abbreviations.
#+begin_src emacs-lisp
(use-package abbrev
  :ensure nil
  :hook (text-mode . abbrev-mode) ;; `text-mode' is a parent of `org-mode'
  :config
  (if (custom/termux-p)
      (setq abbrev-file-name "~/storage/shared/Sync/backup/abbrev_defs.el")
    (setq abbrev-file-name "~/Sync/backup/abbrev_defs.el"))
  )
#+end_src

I have /btw/ set for /by the way/.
The cool thing is when you type /Btw/ you get /By the way/ with capital /B/ at the beginning.
*** File history
=recentf= is built-in package for remembering file visit history.
#+begin_src emacs-lisp
(use-package recentf
  :hook ((after-init . recentf-mode)
         (kill-emacs . #'recentf-save-list))
  :bind (("C-c f r" . recentf-open))
  :custom
  (recentf-save-file (expand-file-name "recentf" custom/user-share-emacs-directory)) ; location of the file
  (recentf-max-saved-items nil) ; infinite amount of entries in recentf file
  (recentf-auto-cleanup 'never) ; not cleaning recentf file
  )
#+end_src
*** Remembering file place
#+begin_src emacs-lisp
(use-package saveplace
  :ensure nil
  :hook (after-init . save-place-mode))
#+end_src
*** EWW
#+begin_src emacs-lisp
(use-package eww
  :custom (eww-auto-rename-buffer 'title))
#+end_src
*** Line numbers
#+begin_src emacs-lisp
(use-package display-line-numbers
  :hook (prog-mode . display-line-numbers-mode)
  :custom (display-line-numbers-type 'relative))
#+end_src
*** Project management
I'm using built-in =project= package.
#+begin_src emacs-lisp
(use-package project
  :custom (project-list-file (expand-file-name "projects" custom/user-share-emacs-directory)))
#+end_src
*** Tabs
=tab-bar= is built-in package that emulates web browser tab behaviour.
At first I wanted to use [[https://github.com/nex3/perspective-el][perspective]] to have workspaces but it didn't work so I opted for this.
#+begin_src emacs-lisp
(use-package tab-bar
  :init
  (tab-bar-mode 1)
  ;; (advice-add #'tab-new
  ;;             :after
  ;;             (lambda (&rest _) (when (y-or-n-p "Rename tab? ")
  ;;                                 (call-interactively #'tab-rename))))
  :custom-face
  (tab-bar-tab ((nil (:foreground "#151515" :background "#c8c5c7"))))
  :custom
  (tab-bar-show 1)                     ;; hide bar if <= 1 tabs open
  (tab-bar-close-button-show nil)      ;; hide tab close / X button
  (tab-bar-new-button-show nil)      ;; hide tab close / X button
  (tab-bar-tab-hints t)                ;; show tab numbers
  (tab-bar-auto-width-max nil)
  )
#+end_src
*** Ibuffer
#+begin_src emacs-lisp
(use-package ibuffer
  :bind ("C-x C-b" . ibuffer)
  :custom (ibuffer-default-sorting-mode 'filename/process))
#+end_src
** Appearance
*** Dashboard
I'm using [[https://github.com/ichernyshovvv/enlight][enlight]] as it allows for a very minimal dashboard.
#+begin_src emacs-lisp
(use-package enlight
  :hook (enlight-mode . (lambda () (with-current-buffer "*enlight*"
                                    (emacs-lock-mode 'kill))))
  :custom
  (initial-buffer-choice #'enlight)
  (tab-bar-new-tab-choice #'enlight) ;; buffer to show in new tabs
  (enlight-content
   (concat
    (propertize "Welcome to the Church of Emacs" 'face 'success)
    "\n"
    (concat "Startup time: " (emacs-init-time))
    "\n"
    (enlight-menu
     '(("Org Mode"
        ("Org-Agenda (current day)" (org-agenda nil "a") "a")
        ("Org-Agenda (all ideas)" (org-todo-list "IDEA") "i")
        ("Org-Roam notes" (org-roam-node-find) "n")
        ("Org-Roam today daily" (org-roam-dailies-goto-today) "d"))
       ("Other"
        ("Projects" project-switch-project "p"))
       ("Notes to self"
        ("Press q instead of killing buffers"))))))
)
#+end_src
*** Fonts
**** Setting fonts
#+begin_src emacs-lisp
(set-face-attribute 'default nil
                    :font "JetBrainsMono NFM"
                    :height 90
                    :weight 'medium)
(set-face-attribute 'variable-pitch nil
                    :family "Ubuntu Nerd Font"
                    :height 100
                    :weight 'medium)
(set-face-attribute 'fixed-pitch nil
                    :family "JetBrainsMono NFM Mono"
                    :height 80
                    :weight 'medium)
(set-face-attribute 'fixed-pitch-serif nil
                    :inherit 'fixed-pitch
                    :slant 'italic)

;; Makes commented text and keywords italics.
;; This is working in emacsclient but not emacs.
;; Your font must have an italic face available.
(set-face-attribute 'font-lock-comment-face nil
                    :slant 'italic)
;; (set-face-attribute 'font-lock-keyword-face nil
;;   :slant 'italic)

;; This sets the default font on all graphical frames created after restarting Emacs.
;; Does the same thing as 'set-face-attribute default' above, but emacsclient fonts
;; are not right, idk why
(add-to-list 'default-frame-alist '(font . "JetBrainsMono NFM-9"))

;; Uncomment the following line if line spacing needs adjusting.
;; (setq-default line-spacing 0.12)
#+end_src
**** Enabling programming ligatures
Some fonts like [[https://github.com/tonsky/FiraCode/][Fira Code]] have so called /programming ligatures/ that are essentailly nice symbols for combinations of symbols.
[[https://github.com/mickeynp/ligature.el][ligature.el]] allows us in Emacs to use them.
#+begin_src emacs-lisp
(use-package ligature
  :after prog-mode
  :hook (prog-mode . ligature-mode)
  :config
  (ligature-set-ligatures 't '("www"))
  ;; Enable ligatures in programming modes
  (ligature-set-ligatures 'prog-mode '("--" "---" "==" "===" "!=" "!==" "=!=" "=:=" "=/=" "<=" ">=" "&&" "&&&" "&=" "++" "+++" "***" ";;" "!!" "??" "???" "?:" "?." "?=" "<:" ":<" ":>" ">:" "<:<" "<>" "<<<" ">>>" "<<" ">>" "||" "-|" "_|_" "|-" "||-" "|=" "||=" "##" "###" "####" "#{" "#[" "]#" "#(" "#?" "#_" "#_(" "#:" "#!" "#=" "^=" "<$>" "<$" "$>" "<+>" "<+" "+>" "<*>" "<*" "*>" "</" "</>" "/>" "<!--" "<#--" "-->" "->" "->>" "<<-" "<-" "<=<" "=<<" "<<=" "<==" "<=>" "<==>" "==>" "=>" "=>>" ">=>" ">>=" ">>-" ">-" "-<" "-<<" ">->" "<-<" "<-|" "<=|" "|=>" "|->" "<->" "<~~" "<~" "<~>" "~~" "~~>" "~>" "~-" "-~" "~@" "[||]" "|]" "[|" "|}" "{|" "[<" ">]" "|>" "<|" "||>" "<||" "|||>" "<|||" "<|>" "..." ".." ".=" "..<" ".?" "::" ":::" ":=" "::=" ":?" ":?>" "//" "///" "/*" "*/" "/=" "//=" "/==" "@_" "__" "???" "<:<" ";;;")))
#+end_src
**** Mixed Pitch :ARCHIVE:
[[https://gitlab.com/jabranham/mixed-pitch][This]] incorprates variable pitch font into modes. In cases where you would want to keep fixed width font then it will probably keep that font.
I turn that mode in Org Mode.
#+begin_src emacs-lisp
(use-package mixed-pitch
  :unless (custom/termux-p)
  :hook (org-mode . mixed-pitch-mode)
  :diminish
  :config
  (dolist (faces '(;; org-level-1
                   ;; org-level-2
                   ;; org-level-3
                   ;; org-level-4
                   ;; org-level-5
                   ;; org-level-6
                   ;; org-level-7
                   ;; org-level-8
                   org-modern-label
                   org-property-value
                   org-special-keyword
                   org-drawer
                   org-document-face))
    (add-to-list 'mixed-pitch-fixed-pitch-faces faces)))
#+end_src
*** Highlight TODO
Adding highlights to TODO and related words.
#+begin_src emacs-lisp
(use-package hl-todo
  :hook ((org-mode . hl-todo-mode)
         (prog-mode . hl-todo-mode))
  :custom
  (hl-todo-highlight-punctuation ":")
  (hl-todo-keyword-faces
   `(("TODO"       warning bold)
     ("FIXME"      error bold)
     ("HACK"       font-lock-constant-face bold)
     ("REVIEW"     font-lock-keyword-face bold)
     ("NOTE"       success bold)
     ("DEPRECATED" font-lock-doc-face bold))))
#+end_src
*** Icons
**** [[https://github.com/domtronn/all-the-icons.el][ALL THE ICONS]] :ARCHIVE:
#+begin_src emacs-lisp
(use-package all-the-icons
  :if (display-graphic-p))

(use-package all-the-icons-dired
  :after dired
  :hook (dired-mode . all-the-icons-dired-mode))

(use-package all-the-icons-ibuffer
  :after ibuffer
  :hook (ibuffer-mode . all-the-icons-ibuffer-mode))

(use-package all-the-icons-completion
  :after marginalia
  :hook (marginalia-mode . #'all-the-icons-completion-marginalia-setup)
  :config
  (all-the-icons-completion-mode))
#+end_src
**** [[https://github.com/rainstormstudio/nerd-icons.el][NERD ICONS]]
#+begin_src emacs-lisp
(use-package nerd-icons)

(use-package nerd-icons-dired
  :after dired
  :hook (dired-mode . nerd-icons-dired-mode)
  :config
  (advice-add #'wdired-change-to-wdired-mode :before
              (lambda ()
                (if nerd-icons-dired-mode
                    (nerd-icons-dired-mode -1))))
  (advice-add #'wdired-finish-edit :after
              (lambda ()
                (unless nerd-icons-dired-mode
                  (nerd-icons-dired-mode 1))))
  (advice-add #'wdired-exit :after
              (lambda ()
                (unless nerd-icons-dired-mode
                  (nerd-icons-dired-mode 1))))
  (advice-add #'wdired-abort-changes :after
              (lambda ()
                (unless nerd-icons-dired-mode
                  (nerd-icons-dired-mode 1))))
  )

(use-package nerd-icons-ibuffer
  :hook (ibuffer-mode . nerd-icons-ibuffer-mode))

(use-package nerd-icons-completion
  :after marginalia
  :hook (marginalia-mode . #'nerd-icons-completion-marginalia-setup)
  :config (nerd-icons-completion-mode))
#+end_src
