.config/emacs/config.org
*** Modeline
[[https://github.com/seagle0128/doom-modeline][doom-modeline]] is a bar at the bottom of the screen
#+begin_src emacs-lisp
(use-package doom-modeline
  :hook (after-init . doom-modeline-mode)
  :custom (doom-modeline-battery t))
#+end_src
*** Rainbow delimiters
Adding coloring to parentheses.
#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src
*** Dispaly color codes
[[https://github.com/DevelopmentCool2449/colorful-mode][colorful-mode]] displays the actual color as a background for any hex color value (ex. #ffffff).
#+begin_src emacs-lisp
(use-package colorful-mode
  :hook (prog-mode text-mode))
#+end_src
*** Theme
I started to use [[https://github.com/dylanaraps/pywal][pywal]] for my ricing so I use [[https://github.com/cyruseuros/ewal][this]] as my theme.
#+begin_src emacs-lisp
(use-package doom-themes
  ;; :demand
  :custom
  (doom-themes-enable-bold t)   ; if nil, bold is universally disabled
  (doom-themes-enable-italic t) ; if nil, italics is universally disabled
  :config
  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)
  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))

(if (custom/termux-p)
    (load-theme 'doom-dracula t) ;; if on termux, use some doom theme
  ;; (progn
  (use-package ewal-doom-themes
    :demand
    :config
    (set-face-attribute 'line-number-current-line nil
                        :foreground (ewal-load-color 'comment)
                        :inherit 'default)
    (set-face-attribute 'line-number nil
                        :foreground (ewal--get-base-color 'green)
                        :inherit 'default)
    (load-theme 'ewal-doom-one t))
  ;; )
  )
#+end_src

With Emacs 29, true transparency has been added.
#+begin_src emacs-lisp
(add-to-list 'default-frame-alist '(alpha-background . 95)) ; For all new frames henceforth
#+end_src
** Completion
*** In-buffer completion (corfu)
[[https://github.com/minad/corfu][corfu]] is minimal completion provider aligning with Emacs built-in tools.
#+begin_src emacs-lisp
(use-package corfu
  :hook (;; (meow-insert-exit . custom/corfu-cleanup)
         (prog-mode . corfu-mode)
         (corfu-mode . corfu-popupinfo-mode))
  :custom
  (corfu-auto t)
  (corfu-auto-prefix 1)
  (corfu-popupinfo-delay nil)
  (tab-always-indent 'complete)
  :custom-face
  (corfu-current ((nil (:inherit vertico-current))))
  ;; :preface
  ;; ;; it doesn't exit when using meow, the fix was inspired by https://gitlab.com/daniel.arnqvist/emacs-config/-/blob/master/init.el?ref_type=heads#L147
  ;; (defun custom/corfu-cleanup ()
  ;;   "Close corfu popup if it is active."
  ;;   (if (boundp 'corfu-mode)
  ;;       (if corfu-mode (corfu-quit))))
  :bind (:map corfu-map
              ("C-j" . corfu-next)
              ("C-k" . corfu-previous)
              ("<escape>" . corfu-quit)))

(use-package nerd-icons-corfu
  :after corfu
  :hook (corfu-mode . (lambda () (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter)))
  )
#+end_src
*** Minibuffer completion (vertico with consult)
The completion that you get when doing =M-x= for example that lists candidates to choose from.
**** Vertico
I switched from [[https://github.com/abo-abo/swiper#ivy][Ivy]] to [[https://github.com/minad/vertico][Vertico]] because it's simpler.
I don't need it loading immediately so I defer it by a second.
#+begin_src emacs-lisp
(use-package vertico
  :defer 1
  :bind (:map vertico-map
              ("C-j" . vertico-next)
              ("C-k" . vertico-previous)
              ("C-l" . vertico-exit)
              )
  :custom
  (enable-recursive-minibuffers t)
  (vertico-multiform-commands
   '((recentf-open (vertico-sort-function . nil)))) ;; `recentf-open' will not have sorted entries
  :config
  (vertico-mode)
  (vertico-mouse-mode t)
  (vertico-multiform-mode)
  )
#+end_src

=vertico-directory= extension makes file navigation easier
#+begin_src emacs-lisp
(use-package vertico-directory
  :after vertico
  :ensure nil
  ;; More convenient directory navigation commands
  :bind (:map vertico-map
              ("RET" . vertico-directory-enter)
              ("C-l" . vertico-directory-enter)
              ("DEL" . vertico-directory-delete-char)
              ("M-DEL" . vertico-directory-delete-word))
  ;; Tidy shadowed file names
  :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))
#+end_src

[[https://github.com/oantolin/orderless][Orderless]] is used for using different completion style across whole Emacs.
#+begin_src emacs-lisp
(use-package orderless
  :after vertico
  :init
  ;; Configure a custom style dispatcher (see the Consult wiki)
  ;; (setq orderless-style-dispatchers '(+orderless-consult-dispatch orderless-affix-dispatch)
  ;;       orderless-component-separator #'orderless-escapable-split-on-space)
  (setq completion-styles '(orderless basic)
        completion-category-defaults nil
        completion-category-overrides '((file (styles partial-completion)))))
#+end_src

Built-in =savehist-mode= saves minibuffer history
#+begin_src emacs-lisp
(use-package savehist
  :init (savehist-mode t)
  :custom (savehist-file (expand-file-name "history" custom/user-share-emacs-directory)))
#+end_src
**** Consult
[[https://github.com/minad/consult][Consult]] has lots of useful commands with minibuffer completion.
#+begin_src emacs-lisp
(use-package consult
  ;; :after vertico
  :init
  ;; Use `consult-completion-in-region' if Vertico is enabled.
  ;; Otherwise use the default `completion--in-region' function.
  (setq completion-in-region-function
        (lambda (&rest args)
          (apply (if vertico-mode
                     #'consult-completion-in-region
                   #'completion--in-region)
                 args)))
  (defalias 'project-find-file 'consult-project-buffer)
  :bind
  ([remap project-find-file] . consult-project-buffer)
  ([remap goto-line] . consult-goto-line)
  ([remap imenu] . consult-imenu)
  :config
  ;; disabling `display-buffer-alist' for `consult-project-buffer'
  (advice-add 'consult-project-buffer :around
              (lambda (orig-fun &rest args)
                (let ((display-buffer-alist nil))
                  (apply orig-fun args))))
  )
#+end_src
**** Annotations (marginalia)
[[https://github.com/minad/marginalia][Marginalia]] shows candidatate's annotations
#+begin_src emacs-lisp
(use-package marginalia
  :after vertico
  :bind (:map minibuffer-local-map
              ("M-A" . marginalia-cycle))
  :custom (marginalia--pangram "Lorem ipsum dolor sit amet, consectetur adipiscing elit.")
  :init (marginalia-mode))
#+end_src
** Dired
Dired is bult-in file manager for Emacs. It uses =ls= for displaying directories.
I don't know why, but I always think that dired doesn't have moving file functionality.
It has with renaming function by pressing =R=. You can rename the file and/or move it to some other directory just like =mv= shell command.
*** Dired
I still do some configurations because dirvish at its core uses dired and its keybindings.
#+begin_src emacs-lisp
(use-package dired
  :ensure nil
  :hook (dired-mode . dired-hide-details-mode)
  :bind (:map dired-mode-map
              ("b" . dired-up-directory))
  :custom
  (insert-directory-program "ls")
  (dired-listing-switches "-lvX --almost-all --group-directories-first --human-readable")
  (dired-kill-when-opening-new-dired-buffer t)
  (image-dired-dir (expand-file-name "image-dired" custom/user-share-emacs-directory))
  (dired-auto-revert-buffer t)
  (dired-hide-details-hide-symlink-targets nil)
  (dired-recursive-copies 'always)
  (dired-recursive-deletes 'always)
  (dired-vc-rename-file t)
  (dired-guess-shell-alist-user
   (list '("\\.\\(png\\|jpg\\|jpeg\\|gif\\|svg\\|bmp\\|webp\\)$" "swayimg")
         '("\\.\\(pdf\\|epub\\)$" "zathura")))
  (dired-dwim-target t)
  :config
  (defun dired-do-flush-lines (regexp)
    "Do `flush-lines' on all marked files.
REGEXP is the argument used for `flush-lines'."
    (interactive "s")
    (dired-map-over-marks-check
     (lambda ()
       (let ((file (dired-get-filename)))
         (with-temp-buffer
           (insert-file-contents file)
           (flush-lines regexp)
           (write-region (point-min) (point-max) file)))
       nil)
     nil
     'flush-score-blocks-in-dired-files))
  )

(use-package diredfl
  :after dired
  :hook
  ((dired-mode . diredfl-mode)
   ;; highlight parent and directory preview as well
   (dirvish-directory-view-mode . diredfl-mode))
  :config
  (set-face-attribute 'diredfl-dir-name nil :bold t))
#+end_src
