.config/emacs/init.el

(use-package doom-modeline
  :hook (after-init . doom-modeline-mode)
  :custom (doom-modeline-battery t))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package colorful-mode
  :hook (prog-mode text-mode))

(use-package doom-themes
  ;; :demand
  :custom
  (doom-themes-enable-bold t)   ; if nil, bold is universally disabled
  (doom-themes-enable-italic t) ; if nil, italics is universally disabled
  :config
  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)
  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))

(if (custom/termux-p)
    (load-theme 'doom-dracula t) ;; if on termux, use some doom theme
  ;; (progn
  (use-package ewal-doom-themes
    :demand
    :config
    (set-face-attribute 'line-number-current-line nil
                        :foreground (ewal-load-color 'comment)
                        :inherit 'default)
    (set-face-attribute 'line-number nil
                        :foreground (ewal--get-base-color 'green)
                        :inherit 'default)
    (load-theme 'ewal-doom-one t))
  ;; )
  )

(add-to-list 'default-frame-alist '(alpha-background . 95)) ; For all new frames henceforth

(use-package corfu
  :hook ((meow-insert-exit . custom/corfu-cleanup)
         (prog-mode . corfu-mode)
         (corfu-mode . corfu-popupinfo-mode))
  :custom
  (corfu-auto t)
  (corfu-auto-prefix 1)
  (corfu-popupinfo-delay nil)
  (tab-always-indent 'complete)
  :preface
  ;; it doesn't exit when using meow, the fix was inspired by https://gitlab.com/daniel.arnqvist/emacs-config/-/blob/master/init.el?ref_type=heads#L147
  (defun custom/corfu-cleanup ()
    "Close corfu popup if it is active."
    (if (boundp 'corfu-mode)
        (if corfu-mode (corfu-quit))))
  :bind (:map corfu-map
              ("C-j" . corfu-next)
              ("C-k" . corfu-previous)
              ("ESC" . corfu-quit)))

(use-package nerd-icons-corfu
  :after corfu
  :hook (corfu-mode . (lambda () (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter)))
  )

(use-package vertico
  :defer 1
  :bind (:map vertico-map
              ("C-j" . vertico-next)
              ("C-k" . vertico-previous)
              ("C-l" . vertico-exit)
              )
  :custom
  (enable-recursive-minibuffers t)
  (vertico-multiform-commands
   '((recentf-open (vertico-sort-function . nil)))) ;; `recentf-open' will not have sorted entries
  :config
  (vertico-mode)
  (vertico-mouse-mode t)
  (vertico-multiform-mode)
  )

(use-package vertico-directory
  :after vertico
  :ensure nil
  ;; More convenient directory navigation commands
  :bind (:map vertico-map
              ("RET" . vertico-directory-enter)
              ("C-l" . vertico-directory-enter)
              ("DEL" . vertico-directory-delete-char)
              ("M-DEL" . vertico-directory-delete-word))
  ;; Tidy shadowed file names
  :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))

(use-package orderless
  :after vertico
  :init
  ;; Configure a custom style dispatcher (see the Consult wiki)
  ;; (setq orderless-style-dispatchers '(+orderless-consult-dispatch orderless-affix-dispatch)
  ;;       orderless-component-separator #'orderless-escapable-split-on-space)
  (setq completion-styles '(orderless basic)
        completion-category-defaults nil
        completion-category-overrides '((file (styles partial-completion)))))

(use-package savehist
  :init (savehist-mode t)
  :custom (savehist-file (expand-file-name "history" custom/user-share-emacs-directory)))

(use-package consult
  ;; :after vertico
  :init
  ;; Use `consult-completion-in-region' if Vertico is enabled.
  ;; Otherwise use the default `completion--in-region' function.
  (setq completion-in-region-function
        (lambda (&rest args)
          (apply (if vertico-mode
                     #'consult-completion-in-region
                   #'completion--in-region)
                 args)))
  (defalias 'project-find-file 'consult-project-buffer)
  :bind
  ([remap project-find-file] . consult-project-buffer)
  ([remap goto-line] . consult-goto-line)
  ([remap imenu] . consult-imenu)
  :config
  ;; disabling `display-buffer-alist' for `consult-project-buffer'
  (advice-add 'consult-project-buffer :around
              (lambda (orig-fun &rest args)
                (let ((display-buffer-alist nil))
                  (apply orig-fun args))))
  )

(use-package marginalia
  :after vertico
  :bind (:map minibuffer-local-map
              ("M-A" . marginalia-cycle))
  :custom (marginalia--pangram "Lorem ipsum dolor sit amet, consectetur adipiscing elit.")
  :init (marginalia-mode))

(use-package dired
  :ensure nil
  :hook (dired-mode . dired-hide-details-mode)
  :bind (:map dired-mode-map
              ("b" . dired-up-directory))
  :custom
  (insert-directory-program "ls")
  (dired-listing-switches "-lv --almost-all --group-directories-first --human-readable")
  (dired-kill-when-opening-new-dired-buffer t)
  (image-dired-dir (expand-file-name "image-dired" custom/user-share-emacs-directory))
  (dired-auto-revert-buffer t)
  (dired-hide-details-hide-symlink-targets nil)
  (dired-recursive-copies 'always)
  (dired-recursive-deletes 'always)
  (dired-vc-rename-file t)
  (dired-guess-shell-alist-user
   (list '("\\.\\(png\\|jpg\\|jpeg\\|gif\\|svg\\|bmp\\|webp\\)$" "swayimg")))
  :config
  (defun dired-do-flush-lines (regexp)
    "Do `flush-lines' on all marked files.
REGEXP is the argument used for `flush-lines'."
    (interactive "s")
    (dired-map-over-marks-check
     (lambda ()
       (let ((file (dired-get-filename)))
         (with-temp-buffer
           (insert-file-contents file)
           (flush-lines regexp)
           (write-region (point-min) (point-max) file)))
       nil)
     nil
     'flush-score-blocks-in-dired-files))
  )

(use-package diredfl
  :after dired
  :hook
  ((dired-mode . diredfl-mode)
   ;; highlight parent and directory preview as well
   (dirvish-directory-view-mode . diredfl-mode))
  :config
  (set-face-attribute 'diredfl-dir-name nil :bold t))
