.config/emacs/config.org
*** Dirvish :ARCHIVE:
[[https://github.com/alexluigit/dirvish][Dirvish]] is well made ranger/lf like dired extension.
+I don't currently use that since it displays all files as buffers and doesn't kill them.+
It kills the buffers when =dirvish-quit= is called or when you enter the file.
#+begin_src emacs-lisp
(use-package dirvish
  :unless (custom/termux-p)
  :init (dirvish-override-dired-mode t) ; dirvish takes over dired
  :custom
  (dirvish-cache-dir (expand-file-name "dirvish" custom/user-share-emacs-directory))
  (dirvish-attributes '(collapse git-msg file-time file-size))
  (dirvish-default-layout '(1 0.15 0.5))
  :config
  ;; (evil-collection-define-key 'normal 'dirvish-mode-map
  ;;   "p" 'dirvish-yank-menu
  ;;   "q" 'dirvish-quit)
  ;; (dirvish-define-preview eza (file)
  ;;   "Use `eza' to generate directory preview."
  ;;   :require ("eza") ; tell Dirvish to check if we have the executable
  ;;   (when (file-directory-p file) ; we only interest in directories here
  ;;     `(shell . ("eza" "-al" "--color=always" "--icons"
  ;;                "--group-directories-first" ,file))))
  ;; (add-to-list 'dirvish-preview-dispatchers 'eza)
  ;; lines not wrapping
  (add-hook 'dirvish-find-entry-hook
            (lambda (&rest _) (setq-local truncate-lines t)))
  ;; rebinds all dired commands to `dirvish-dwim' so when I only have 1 window dirvish will have 3 pane view
  ;; (defalias 'dired 'dirvish-dwim)
  )
#+end_src
** Docs
*** Helpful
[[https://github.com/Wilfred/helpful][This]] makes Emacs documentation look pretty.
#+begin_src emacs-lisp
(use-package helpful
  :bind
  ([remap describe-function] . helpful-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-symbol] . helpful-symbol)
  ([remap describe-variable] . helpful-variable)
  ([remap describe-key] . helpful-key)
  ("C-h C-." . helpful-at-point)
  :custom (helpful-max-buffers nil)
  )
#+end_src
*** Which-key
[[https://github.com/justbur/emacs-which-key][It]] shows you available keybindings, the default ones and the ones you create.
It takes few seconds to load and that's why I defer it by 5 seconds.
#+begin_src emacs-lisp
(use-package which-key
  :unless (custom/termux-p)
  :diminish
  :defer 5
  :custom
  (which-key-side-window-location 'bottom)
  (which-key-sort-order #'which-key-key-order-alpha)
  (which-key-sort-uppercase-first nil)
  (which-key-add-column-padding 1)
  (which-key-max-display-columns nil)
  (which-key-min-display-lines 6)
  (which-key-max-description-length nil)
  (which-key-allow-imprecise-window-fit nil)
  (which-key-separator "  ")
  (which-key-idle-delay 0.5)
  :config
  (which-key-mode 1))
#+end_src
** Elfeed
[[https://github.com/skeeto/elfeed][Elfeed]] is a RSS feed reader.
#+begin_src emacs-lisp
(use-package elfeed
  :unless (custom/termux-p)
  :custom
  (elfeed-db-directory (expand-file-name "elfeed" custom/user-share-emacs-directory)) ; cache? directory
  (elfeed-feeds  '("https://sachachua.com/blog/feed/" "https://planet.emacslife.com/atom.xml"))
  (elfeed-search-filter "@6-months-ago")
  :bind (:map elfeed-search-mode-map)
  ("f" . elfeed-search-show-entry))
#+end_src
** Magit
[[https://magit.vc/][Magit]] is a git client.
#+begin_src emacs-lisp
(use-package magit
  :custom
  (magit-display-buffer-function 'magit-display-buffer-fullframe-status-topleft-v1)
  (magit-bury-buffer-function 'magit-restore-window-configuration))
#+end_src
** Org Mode
[[https://orgmode.org/][Org Mode]] is one of the killer features of Emacs.
It's very big markup language like Markdown.
Here I'm improving it as much as I can.
