.config/emacs/init.el
  (org-mode . (lambda () (add-hook 'text-scale-mode-hook #'custom/org-resize-latex-overlays nil t)))
  (org-mode . electric-pair-local-mode)
  ;; after archiving tasks, agenda files aren't saved, I fix that
  (org-archive . (lambda () (save-some-buffers '('org-agenda-files))))
  ;; (org-capture-after-finalize . (lambda () (save-some-buffers '('org-agenda-files))))
  :bind
  ([remap org-return] . custom/org-good-return)
  ("C-c n a" . org-agenda)
  ("C-c n c" . org-capture)
  (:map org-mode-map
        ("C-x n t" . org-toggle-narrow-to-subtree))
  :custom-face
  ;; setting size of headers
  (org-document-title ((nil (:inherit outline-1 :height 1.7))))
  (org-level-1 ((nil (:inherit outline-1 :height 1.2))))
  (org-level-2 ((nil (:inherit outline-2 :height 1.2))))
  (org-level-3 ((nil (:inherit outline-3 :height 1.2))))
  (org-level-4 ((nil (:inherit outline-4 :height 1.2))))
  (org-level-5 ((nil (:inherit outline-5 :height 1.2))))
  (org-level-6 ((nil (:inherit outline-6 :height 1.2))))
  (org-level-7 ((nil (:inherit outline-7 :height 1.2))))
  (org-list-dt ((nil (:weight bold))))
  (org-agenda-date-today ((nil (:height 1.3))))
  ;; (org-ellipsis ((nil (:underline t))))
  :custom
  (org-todo-keywords
   '((sequence
      "TODO(t)"  ; A task that needs doing & is ready to do
      "PROJ(p)"  ; A project, which usually contains other tasks
      "LOOP(r)"  ; A recurring task
      "STRT(s)"  ; A task that is in progress
      "WAIT(w)"  ; Something external is holding up this task
      "HOLD(h)"  ; This task is paused/on hold because of me
      "IDEA(i)"  ; An unconfirmed and unapproved task or notion
      "|"
      "DONE(d)"  ; Task successfully completed
      "KILL(k)") ; Task was cancelled, aborted or is no longer applicable
     (sequence
      "[ ](T)"   ; A task that needs doing
      "[-](S)"   ; Task is in progress
      "[?](W)"   ; Task is being held up or paused
      "|"
      "[X](D)")  ; Task was completed
     (sequence
      "|"
      "OKAY(o)"
      "YES(y)"
      "NO(n)")))
  (org-capture-templates
   '(("t" "Todo" entry (file "agenda/inbox.org")
      "* TODO %?\n %a")))
  ;; ============ org agenda ============
  (org-agenda-files (list (expand-file-name "agenda/agenda.org" org-roam-directory)(expand-file-name "agenda/inbox.org" org-roam-directory)))
  (org-archive-location (expand-file-name "agenda/agenda-archive.org::" org-roam-directory))
  (org-agenda-prefix-format ;; format at which tasks are displayed
   '((agenda . " %i ")
     (todo . " %i ")
     (tags . "%c %-12:c")
     (search . "%c %-12:c")))
  (org-agenda-category-icon-alist ;; icons for categories
   `(("tech" ,(list (nerd-icons-mdicon "nf-md-laptop" :height 1.5)) nil nil :ascent center)
     ("school" ,(list (nerd-icons-mdicon "nf-md-school" :height 1.5)) nil nil :ascent center)
     ("personal" ,(list (nerd-icons-mdicon "nf-md-drama_masks" :height 1.5)) nil nil :ascent center)
     ("content" ,(list (nerd-icons-faicon "nf-fae-popcorn" :height 1.5)) nil nil :ascent center)))
  (org-agenda-include-all-todo nil)
  (org-agenda-start-day "+0d")
  ;; (org-agenda-span 3)
  (org-agenda-hide-tags-regexp ".*")
  (org-agenda-skip-scheduled-if-done t)
  (org-agenda-skip-deadline-if-done t)
  (org-agenda-skip-timestamp-if-done t)
  (org-agenda-columns-add-appointments-to-effort-sum t)
  ;; (org-agenda-custom-commands nil)
  (org-agenda-default-appointment-duration 60)
  (org-agenda-mouse-1-follows-link t)
  (org-agenda-skip-unavailable-files t)
  (org-agenda-use-time-grid nil)
  (org-agenda-block-separator 8411)
  (org-agenda-window-setup 'current-window)
  (org-refile-targets '((org-agenda-files :maxlevel . 1)))
  (org-refile-use-outline-path nil)
  (org-hide-emphasis-markers t)
  ;; (org-hide-leading-stars t)
  (org-html-validation-link nil)
  (org-pretty-entities t)
  (org-image-actual-width '(300 600))
  (org-startup-with-inline-images t)
  (org-startup-indented t) ;; use `org-indent-mode' at startup
  (org-indent-mode-turns-on-hiding-stars nil)
  ;; (org-cycle-inline-images-display t)
  (org-cycle-separator-lines 0)
  (org-display-remote-inline-images 'download)
  (org-list-allow-alphabetical t)
  (org-log-done t)
  (org-log-into-drawer t) ;; time tamps from headers and etc. get put into :LOGBOOK: drawer
  (org-fontify-quote-and-verse-blocks t)
  (org-preview-latex-image-directory (expand-file-name "org/lateximg/" custom/user-share-emacs-directory))
  (org-preview-latex-default-process 'dvisvgm)
  (org-latex-to-html-convert-command "latexmlc \\='literal:%i\\=' --profile=math --preload=siunitx.sty 2>/dev/null")
  (org-id-link-to-org-use-id 'create-if-interactive-and-no-custom-id)
  (org-id-locations-file (expand-file-name "org/.org-id-locations" custom/user-share-emacs-directory))
  (org-return-follows-link t)
  (org-blank-before-new-entry nil) ;; no blank lines when doing M-return
  (org-M-RET-may-split-line nil)
  (org-insert-heading-respect-content t)
  (org-tags-column 0)
  (org-babel-load-languages '((emacs-lisp . t) (shell . t) (C . t)))
  (org-confirm-babel-evaluate nil)
  (org-edit-src-content-indentation 0)
  (org-src-preserve-indentation t)
  (org-export-preserve-breaks t)
  (org-export-allow-bind-keywords t)
  (org-export-with-toc nil)
  (org-export-with-smart-quotes t)
  (org-export-backends '(ascii html icalendar latex odt md))
  ;; (org-export-with-properties t)
  (org-startup-folded t)
  ;; (org-ellipsis "󱞣")
  (org-link-file-path-type 'relative)
  :config
  ;; live latex preview
  (defun custom/org-resize-latex-overlays ()
    "It rescales all latex preview fragments correctly with the text size as you zoom text. It's fast, since no image regeneration is required."
    (cl-loop for o in (car (overlay-lists))
             if (eq (overlay-get o 'org-overlay-type) 'org-latex-overlay)
             do (plist-put (cdr (overlay-get o 'display))
                           :scale (expt text-scale-mode-step
                                        text-scale-mode-amount))))
  (plist-put org-format-latex-options :foreground nil)
  (plist-put org-format-latex-options :background nil)

  ;; meow custom state (inspired by https://aatmunbaxi.netlify.app/comp/meow_state_org_speed/)
  (setq meow-org-motion-keymap (make-keymap))
  (meow-define-state org-motion
    "Org-mode structural motion"
    :lighter "[O]"
    :keymap meow-org-motion-keymap)

  (meow-define-keys 'org-motion
    '("<escape>" . meow-normal-mode)
    '("SPC" . meow-keypad)
    '("i" . meow-insert-mode)
    '("g" . meow-normal-mode)
    '("u" .  meow-undo)
    ;; Moving between headlines
    '("k" .  org-previous-visible-heading)
    '("j" .  org-next-visible-heading)
    '("<up>" .  org-previous-visible-heading)
    '("<down>" .  org-next-visible-heading)
    ;; Moving between headings at the same level
    '("p" .  org-backward-heading-same-level)
    '("n" .  org-forward-heading-same-level)
    '("<left>" .  org-backward-heading-same-level)
    '("<right>" .  org-forward-heading-same-level)
    ;; Moving subtrees themselves
    '("K" .  org-move-subtree-up)
    '("J" .  org-move-subtree-down)
    ;; Subtree de/promotion
    '("L" .  org-demote-subtree)
    '("H" .  org-promote-subtree)
    ;; Completion-style search of headings
    '("v" .  consult-org-heading)
    ;; Setting subtree metadata
    '("l" .  org-set-property)
    '("t" .  org-todo)
    '("d" .  org-deadline)
    '("s" .  org-schedule)
    '("e" .  org-set-effort)
    ;; Block navigation
    '("b" .  org-previous-block)
    '("f" .  org-next-block)
    ;; Narrowing/widening
    '("N" .  org-narrow-to-subtree)
    '("W" .  widen))

  (meow-define-keys 'normal
    '("O" . meow-org-motion-mode))

  ;; In tables pressing RET doesn't follow links.
  ;; I fix that
  (defun custom/org-good-return ()
    "`org-return' that allows for following links in table."
    (interactive)
    (if (org-at-table-p)
        (if (org-in-regexp org-link-any-re 1)
            (org-open-at-point)
          (org-return))
      (org-return)))

  ;; saving agenda files after changing TODO state in `org-agenda'
  (advice-add 'org-agenda-todo :after
              (lambda (&rest _)
                (when (called-interactively-p 'any)
                  (save-some-buffers (list org-agenda-files)))))
  ;; saving agenda files after refiling
  (advice-add #'org-refile
              :after
              (lambda (&rest _) (save-some-buffers 'org-agenda-files)))
  ;; unfolding every header when using `meow-visit'
  (advice-add 'meow-visit :before
              (lambda (&rest _)
                (if (eq major-mode 'org-mode)
                    (unless (eq org-cycle-global-status 'all)
                      (org-fold-show-all)))))
  )

;; it's for html source block syntax highlighting
(use-package htmlize)

(with-eval-after-load 'org
