.config/emacs/config.org
*** Org Tempo
=org-tempo= is a module within org that can be enabled. It allows for '<s' followed by TAB to expand to a =begin_src= tag. Other expansions available include:

| Typing the below + TAB | Expands to ...                      |
|------------------------+-------------------------------------|
| <a                     | =#+BEGIN_EXPORT ascii= … =#+END_EXPORT= |
| <c                     | =#+BEGIN_CENTER= … =#+END_CENTER=       |
| <C                     | =#+BEGIN_COMMENT= … =#+END_COMMENT=     |
| <e                     | =#+BEGIN_EXAMPLE= … =#+END_EXAMPLE=     |
| <E                     | =#+BEGIN_EXPORT= … =#+END_EXPORT=       |
| <h                     | =#+BEGIN_EXPORT html= … =#+END_EXPORT=  |
| <l                     | =#+BEGIN_EXPORT latex= … =#+END_EXPORT= |
| <q                     | =#+BEGIN_QUOTE= … =#+END_QUOTE=         |
| <s                     | =#+BEGIN_SRC= … =#+END_SRC=             |
| <v                     | =#+BEGIN_VERSE= … =#+END_VERSE=         |

Since it's not a separate package, I can't use =use-package= on it.
#+begin_src emacs-lisp
(with-eval-after-load 'org
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("sh" . "src sh"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("cpp" . "src cpp"))
  (add-to-list 'org-structure-template-alist '("html" . "src html"))
  ;; The following prevents <> from auto-pairing when electric-pair-mode is on.
  ;; Otherwise, org-tempo is broken when you try to <s TAB...
  (add-hook 'org-mode-hook (lambda ()
                             (setq-local electric-pair-inhibit-predicate
                                         `(lambda (c)
                                            (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c))))))
  )
#+end_src
*** Org appear
With [[https://github.com/awth13/org-appear][this]] emphasis markers will display when hovering on rich text.
It's set up so it will display markers when entering insert mode.
#+begin_src emacs-lisp
(use-package org-appear
  :after org
  :hook (org-mode . org-appear-mode)
  :custom
  (org-appear-trigger 'manual)
  (org-appear-autolinks t)
  :config
  (add-hook 'org-appear-mode-hook (lambda ()
                                    (add-hook 'meow-insert-enter-hook
                                              #'org-appear-manual-start
                                              nil
                                              t)
                                    (add-hook 'meow-insert-exit-hook
                                              #'org-appear-manual-stop
                                              nil
                                              t)))
  )
#+end_src
*** Org auto tangle
[[https://github.com/yilkalargaw/org-auto-tangle][org-auto-tangle]] automatically tangles files that have =#+auto_tangle: t= in them.
#+begin_src emacs-lisp
(use-package org-auto-tangle
  :after org
  :diminish
  :hook (org-mode . org-auto-tangle-mode))
#+end_src
*** Org Roam
[[https://www.orgroam.com/][Org roam]] is nice wiki-like note management thing. Reminds me of [[https://obsidian.md][Obsidian]].
#+begin_src emacs-lisp
(use-package org-roam
  ;; :after org
  :init
  (setq org-roam-v2-ack t)
  (if (custom/termux-p)
      (setq org-roam-directory "~/storage/shared/org-roam")
    (setq org-roam-directory "~/org-roam"))
  :custom
  (org-directory org-roam-directory)
  (org-roam-db-location (expand-file-name "org/org-roam.db" custom/user-share-emacs-directory))
  (org-roam-dailies-directory "journals/")
  (org-roam-node-display-template (concat "${title} " (propertize "${tags}" 'face 'org-tag)))
  (org-roam-capture-templates
   '(("d" "default" plain "%?"
      :target (file+head "${slug}.org"
                         "#+title: ${title}\n#+filetags: %^g\n#+date: %U\n")
      :unnarrowed t)
     ("g" "video game" plain "%?"
      :target (file+head "games/${slug}.org"
                         "#+title: ${title}\n#+filetags: %^g\n#+date: %U\n#+TODO: DROPPED(d) ENDLESS(e) UNFINISHED(u) UNPLAYED(U) TODO(t) | BEATEN(b) COMPLETED(c) MASTERED(m)\n* Status\n| Region | Rating | Ownership | Achievements |\n* Notes")

      :unnarrowed t)
     ("b" "book" plain "%?"
      :target (file+head "books/${slug}.org"
                         "#+title: ${title}\n#+filetags: :books:\n#+date: %U\n#+todo: DROPPED(d) UNFINISHED(u) UNREAD(U) TODO(t) | READ(r)\n* Status\n* Notes")
      :unnarrowed t)
     ("a" "animanga" plain "%?"
      :target (file+head "animan/${slug}.org"
                         "#+title: ${title}\n#+filetags: :animan:\n#+date: %U\n#+TODO: DROPPED(d) UNFINISHED(u) TODO(t) | COMPLETED(c)\n* Anime :anime:\n* Manga :manga:")
      :unnarrowed t)
     ))
  (org-roam-dailies-capture-templates
   '(("d" "default" entry "* %?" :target
      (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n#+filetags: :dailie:\n"))))

  :bind (
         ("C-c n A a" . org-roam-alias-add)
         ("C-c n A r" . org-roam-alias-remove)
         ("C-c n d c" . org-roam-dailies-capture-today)
         ("C-c n d f" . org-roam-dailies-find-date)
         ("C-c n d t" . org-roam-dailies-goto-today)
         ("C-c n d j" . org-roam-dailies-goto-next-note)
         ("C-c n d k" . org-roam-dailies-goto-previous-note)
         ("C-c n D"   . custom/org-roam-notes-dired)
         ("C-c n f"   . org-roam-node-find)
         ("C-c n i"   . org-roam-node-insert)
         ("C-c n l"   . org-roam-buffer-toggle)
         ("C-c n r"   . org-roam-ref-add)
         ("C-c n R"   . org-roam-ref-remove)
         ("C-c n t"   . org-roam-tag-add)
         ("C-c n T"   . org-roam-tag-remove)
         )
  :config
  (org-roam-setup)
  (require 'org-roam-export)
  ;; if the file is dailie then increase buffer's size automatically
  (require 'org-roam-dailies)
  ;; (add-hook 'org-roam-dailies-find-file-hook (lambda () (text-scale-set 3)))
  ;; (add-hook 'find-file-hook (lambda () (if (org-roam-dailies--daily-note-p) (text-scale-set 3))))
  (defun custom/org-roam-notes-dired ()
    "Opens org-roam-directory in Dired."
    (interactive)
    (dired org-roam-directory))
  (defun custom/org-add-ids-to-headlines-in-file ()
    "Add ID properties to all headlines in the current file."
    (interactive)
    (org-map-entries 'org-id-get-create))
  )
#+end_src

I like sometimes to use =consult-org-roam-search= to use grep on my notes, and that is in [[https://github.com/jgru/consult-org-roam][consult-org-roam]].
#+begin_src emacs-lisp
(use-package consult-org-roam
  :bind ("C-c n g" . consult-org-roam-search)
  :custom (consult-org-roam-grep-func 'consult-ripgrep))
#+end_src

[[https://github.com/org-roam/org-roam-ui][org-roam-ui]] gives you nice webpage with obsidian looking graph of notes
#+begin_src emacs-lisp
(use-package org-roam-ui
  :custom (org-roam-ui-sync-theme t))
#+end_src
*** Org yt :ARCHIVE:
It creates and displays YouTube links but with some tinkering it can display web images.
#+begin_src emacs-lisp
(use-package org-yt
  :unless (custom/termux-p)
  :after org
  :vc (:fetcher github :repo "TobiasZawada/org-yt")
  :config
  (require 'org-yt)

  (defun custom/org-image-link (protocol link _description)
    "Interpret LINK as base64-encoded image data."
    (cl-assert (string-match "\\`img" protocol) nil
               "Expected protocol type starting with img")
    (let ((buf (url-retrieve-synchronously (concat (substring protocol 3) ":" link))))
      (cl-assert buf nil
                 "Download of image \"%s\" failed." link)
      (with-current-buffer buf
        (goto-char (point-min))
        (re-search-forward "\r?\n\r?\n")
        (buffer-substring-no-properties (point) (point-max)))))

  (org-link-set-parameters
   "imghttp"
   :image-data-fun #'custom/org-image-link)

  (org-link-set-parameters
   "imghttps"
   :image-data-fun #'custom/org-image-link))
#+end_src
*** Sliced images :ARCHIVE:
That makes the images scroll nicely, instead of skipping over them.
#+begin_src emacs-lisp
(use-package org-sliced-images
  :unless (custom/termux-p)
  :after org
  :config
  (defalias 'org-remove-inline-images #'org-sliced-images-remove-inline-images)
  (defalias 'org-toggle-inline-images #'org-sliced-images-toggle-inline-images)
  (defalias 'org-display-inline-images #'org-sliced-images-display-inline-images))
#+end_src
*** TOC
Table of contents after after typing =:toc:= in header
#+begin_src emacs-lisp
(use-package toc-org
  :after org
  :hook (org-mode . #'toc-org-enable)
  :custom
  (toc-org-max-depth org-indent--deepest-level)
  (toc-org-enable-links-opening t))
#+end_src
** Parenthesis
#+begin_src emacs-lisp
(use-package smartparens
  :hook (prog-mode) ;; add `smartparens-mode' to these hooks
  :config (require 'smartparens-config)) ;; load default config
#+end_src
** Programming
This bit is not intended for Termux usage. That's why I include =unless= statement here.
#+begin_src emacs-lisp
(unless (custom/termux-p)
#+end_src
*** Compiling
The great introductions to =M-x compile= are [[https://youtu.be/6oeE52bIFyE][Gavin Freeborn's video]] and [[https://www.masteringemacs.org/article/compiling-running-scripts-emacs][Mastering Emacs article]].
#+begin_src emacs-lisp
(use-package compile
  :bind (("C-c c c" . compile)
         ("C-c c r" . recompile))
  :custom
  (compilation-scroll-output 'first-error)
  (compilation-ask-about-save nil)
  (compilation-always-kill t)
  :config
  (defadvice compile (before ad-compile-smart activate)
    "Advises `compile' so it sets the argument COMINT to t."
    (ad-set-arg 1 t))
  (defadvice recompile (before ad-recompile-smart activate)
    "Advises `recompile' so it sets the argument COMINT to t."
    (setq compilation-arguments (list compile-command t)))
  )
#+end_src
*** Flycheck :ARCHIVE:
[[https://www.flycheck.org][Flycheck]] is on the fly syntax checker.
For more information on language support, [[https://www.flycheck.org/en/latest/languages.html][read this]].
#+begin_src emacs-lisp
(use-package flycheck
  :hook (prog-mode . flycheck-mode))
#+end_src
