.config/emacs/config.org
*** LSP :ARCHIVE:
[[https://github.com/joaotavora/eglot][Eglot]] is from Emacs 29 built-in LSP client.
#+begin_src emacs-lisp
(use-package eglot
  :ensure nil
  :custom (eglot-autoshutdown t))

;; (use-package flycheck-eglot
;;   :after eglot
;;   :hook (eglot-managed-mode . flycheck-eglot-mode))
#+end_src

With this major modes automatically turn on eglot.
#+begin_src emacs-lisp
(dolist (mode '(css-ts-mode-hook
                python-ts-mode-hook
                bash-ts-mode-hook
                c++-ts-mode-hook
                mhtml-mode-hook))
  (add-hook mode 'eglot-ensure))
#+end_src
*** Language support
Emacs has built-in programming language modes for Lisp, Scheme, DSSSL, Ada, ASM, AWK, C, C++, Fortran, Icon, IDL (CORBA), IDLWAVE, Java, Javascript, M4, Makefiles, Metafont, Modula2, Object Pascal, Objective-C, Octave, Pascal, Perl, Pike, PostScript, Prolog, Python, Ruby, Simula, SQL, Tcl, Verilog, and VHDL. Other languages will require additional modes.
#+begin_src emacs-lisp
(use-package lua-mode)
(use-package nix-mode)
#+end_src
*** Languages
**** Shells
#+begin_src emacs-lisp
(use-package sh-script ;; sh-script is the package that declares redirecting shell mode to treesitter mode
  :hook ((bash-ts-mode fish-mode sh-mode)  . custom/sh-set-compile-command)
  :preface
  (defun custom/sh-set-compile-command ()
    "The curent buffer gets `compile-command' changed to the following:
- Current file gets an executable permission by using shell chmod, not Emacs `chmod'
- The current file gets executed"
    (setq-local compile-command (concat "chmod +x " (shell-quote-argument (buffer-file-name)) " && " (shell-quote-argument (buffer-file-name)))))

  :custom (sh-basic-offset 2)
  )
#+end_src
**** C++
#+begin_src emacs-lisp
(use-package cc-mode
  :hook ((c++-mode c++-ts-mode) .  custom/c++-set-compile-command)
  :preface
  (defun custom/c++-set-compile-command ()
    "The curent buffer gets `compile-command' changed to the following:
- The current file gets compiled using g++
- The compiled file gets executed"
    (setq-local compile-command (concat "g++ " (shell-quote-argument (buffer-file-name)) " && ./a.out")))
  :config
  ;; this is for indenting
  (c-set-offset 'comment-intro 0)
  (c-set-offset 'innamespace 0)
  (c-set-offset 'case-label '+)
  (c-set-offset 'access-label 0)
  (c-set-offset 'substatement-open 0)
  )
#+end_src
**** Elisp
#+begin_src emacs-lisp
(defalias 'elisp-mode 'emacs-lisp-mode)
#+end_src
If I'll not forget about it then probably I will get the most use out of [[https://github.com/Malabarba/elisp-bug-hunter][bug-hunter]] with checking errors in my config.
#+begin_src emacs-lisp
(use-package bug-hunter)
#+end_src
**** Python
#+begin_src emacs-lisp
(use-package python
  :hook (python-base-mode . (lambda () (setq-local compile-command (concat "python " (shell-quote-argument (buffer-file-name))))))
  )
#+end_src
**** Web
[[https://github.com/netguy204/imp.el][impatient-mode]] allows for nice website development where the website reacts immediately to any edits.
Since it requires manual https startup and website opening, I automated this in one function.
#+begin_src emacs-lisp
(use-package impatient-mode
  :hook (impatient-mode . custom/impatient-open)
  :preface
  (defun custom/impatient-open ()
    "Opens/closes impatient-mode website.
Depending on `impatient-mode''s (variable) state,
httpd gets started/stopped and the impatient website gets opened
using `browse-url'."
    (if impatient-mode
        (if (httpd-running-p)
            (browse-url (concat "http://localhost:" (number-to-string httpd-port) "/imp"))
          (progn
            (httpd-start)
            (browse-url (concat "http://localhost:" (number-to-string httpd-port) "/imp"))))
      (httpd-stop))))
#+end_src

Here I add autocompletion when typing =>= in html modes.
#+begin_src emacs-lisp
(use-package sgml-mode ;; `html-mode' is defined in sgml-mode package
  :hook (html-mode . (lambda () (smartparens-mode 0)))
  :preface
  (defun html-close-tag ()
    "Inserts >, closes tag, and moves to the >.
After inserting >, it temporarily diables indenting functions, as
they mess the point stored.
NOTE that it will each time close a tag."
    (interactive)
    (insert ">")
    (let ((current-point (point))
          (indent-func indent-line-function)
          (indent-region-func indent-region-function))
      ;; Temporarily disable indentation
      (setq-local indent-line-function 'ignore)
      (setq-local indent-region-function 'ignore)

      (sgml-close-tag)
      (goto-char current-point)

      ;; Restore the original indentation functions
      (setq-local indent-line-function indent-func)
      (setq-local indent-region-function indent-region-func)

      ;; Call the indentation function if it is not nil
      (when indent-func
        (funcall indent-func))))
  :bind (:map html-mode-map
              (">" . html-close-tag)))
#+end_src
*** Lorem ipsum generator
#+begin_src emacs-lisp
(use-package lorem-ipsum
  :custom (lorem-ipsum-sentence-separator " "))
#+end_src
*** Tree-sitter
Emacs from version 29 supports tree-sitter.
Tree-sitter is fast parser and smart syntax highlighter for languages.
You need to have ~tree-sitter~ package installed on your system.
#+begin_src emacs-lisp
(setq treesit-language-source-alist
      '((bash "https://github.com/tree-sitter/tree-sitter-bash")
        ;; (cmake "https://github.com/uyha/tree-sitter-cmake")
        (c "https://github.com/tree-sitter/tree-sitter-c")
        (cpp "https://github.com/tree-sitter/tree-sitter-cpp")
        (css "https://github.com/tree-sitter/tree-sitter-css")
        ;; (elisp "https://github.com/Wilfred/tree-sitter-elisp")
        ;; (go "https://github.com/tree-sitter/tree-sitter-go")
        ;; (html "https://github.com/tree-sitter/tree-sitter-html")
        ;; (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")
        (json "https://github.com/tree-sitter/tree-sitter-json")
        ;; (make "https://github.com/alemuller/tree-sitter-make")
        ;; (markdown "https://github.com/ikatyang/tree-sitter-markdown")
        (python "https://github.com/tree-sitter/tree-sitter-python")))
;; (toml "https://github.com/tree-sitter/tree-sitter-toml")
;; (tsx "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")
;; (typescript "https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src")
;; (yaml "https://github.com/ikatyang/tree-sitter-yaml")))
#+end_src
Now after ~M-x treesit-install-language-grammar~ you can choose language and its tree-sitter parser thing will be installed.

This checks if parsers (only bash) are installed and if not then bulk installs them.
#+begin_src emacs-lisp
(unless (treesit-language-available-p 'bash)
  (message "Installing tree-sitter parsers")
  (mapc #'treesit-install-language-grammar (mapcar #'car treesit-language-source-alist)))
#+end_src

This remaps specified major modes to its tree-sitter counterparts.
#+begin_src emacs-lisp
(setq major-mode-remap-alist
 '((c-or-c++-mode . c-or-c++-ts-mode)
   (c++-mode . c++-ts-mode)
   (css-mode . css-ts-mode)
   (python-mode . python-ts-mode)
   (sh-mode . bash-ts-mode)
   (js-json-mode . json-ts-mode)))
#+end_src
*** Templates
**** Startup templates
~autoinsert~ is built-in mode for inserting text when creating a new file
#+begin_src emacs-lisp
(use-package autoinsert
  :hook (prog-mode . auto-insert-mode)
  :custom
  (auto-insert-directory (expand-file-name "templates/" user-emacs-directory))
  (auto-insert-query nil)
  :config
  (add-to-list 'auto-insert-alist '(bash-ts-mode nil "#!/usr/bin/env bash\n\n"))
  (add-to-list 'auto-insert-alist '(sh-mode nil "#!/usr/bin/env bash\n\n"))
  (add-to-list 'auto-insert-alist '(fish-mode nil "#!/usr/bin/env fish\n\n"))
  (add-to-list 'auto-insert-alist '(python-ts-mode nil "#!/usr/bin/env python\n\n"))
  (add-to-list 'auto-insert-alist '(c++-ts-mode . "cpp.cpp"))
  (add-to-list 'auto-insert-alist '(c++-mode . "cpp.cpp")))
#+end_src
**** Command templates
[[https://github.com/joaotavora/yasnippet][yasnippet]] implements snippets for commands etc.
#+begin_src emacs-lisp
(use-package yasnippet
  :after eglot
  :config (yas-global-mode))

(use-package yasnippet-snippets
  :after yasnippet)
#+end_src

This is the end of =unless= statement.
#+begin_src emacs-lisp
)
#+end_src
** Shells and terminals
*** Shell
#+begin_src emacs-lisp
(use-package fish-mode
  :mode ("\\.fish\\'")
  :custom (fish-indent-offset 2))
#+end_src
*** Eshell
Eshell is an Emacs /shell/ that is written in Elisp.
#+begin_src emacs-lisp
(use-package eshell
  :hook
  (eshell-mode . (lambda () (setq mode-line-format nil)))
  :bind (("C-c s e" . eshell))
  :custom
  (eshell-directory-name (expand-file-name "eshell" user-emacs-directory))
  (eshell-rc-script (expand-file-name "profile" eshell-directory-name))    ;; your profile for eshell; like a bashrc for eshell
  (eshell-aliases-file (expand-file-name "aliases" eshell-directory-name)) ;; sets an aliases file for the eshell
  (eshell-history-file-name (expand-file-name "eshell-history" custom/user-share-emacs-directory))
  (eshell-last-dir-ring-file-name (expand-file-name "eshell-lastdir" custom/user-share-emacs-directory))
  (eshell-history-size 5000)
  (eshell-buffer-maximum-lines 5000)
  (eshell-hist-ignoredups t)
  (eshell-scroll-to-bottom-on-input nil)
  (eshell-destroy-buffer-when-process-dies t)
  (eshell-banner-message "")
  :config
  ;; (keymap-set eshell-mode-map "C-d" #'eshell-life-is-too-much)
  (add-to-list 'meow-mode-state-list '(eshell-mode . insert)))

(use-package eshell-syntax-highlighting
  :after eshell
  :hook (eshell-mode . eshell-syntax-highlighting-mode))
#+end_src
