.config/emacs/config.org
**** EAT
[[https://codeberg.org/akib/emacs-eat][EAT repo link]]
#+begin_src emacs-lisp
(use-package eat
  :after eshell
  :hook (eshell-load . eat-eshell-mode))
#+end_src
*** Vterm
Vterm is a terminal emulator within Emacs.
The =shell-file-name= sets the shell to be used in =M-x shell=, =M-x term=, =M-x ansi-term= and =M-x vterm=.
#+begin_src emacs-lisp
(use-package vterm
  :unless (custom/termux-p)
  :hook ((vterm-mode . (lambda () (setq mode-line-format nil)))
         (meow-normal-mode . (lambda ()
                               (if (string-equal major-mode "vterm-mode")
                                   (unless vterm-copy-mode
                                     (vterm-copy-mode 1)))))
         (meow-insert-mode . (lambda ()
                               (if (string-equal major-mode "vterm-mode")
                                   (if vterm-copy-mode
                                       (vterm-copy-mode 0))))))
  :bind (("C-c s v" . vterm))
  :custom
  ;; (shell-file-name "/bin/fish")
  (vterm-max-scrollback 5000)
  (vterm-always-compile-module t)
  :config
  (add-to-list 'meow-mode-state-list '(vterm-mode . insert))
  )
#+end_src
** Sudo edit
[[https://github.com/nflath/sudo-edit][sudo-edit]] lets you open files with sudo privileges or edit current buffer with such privileges.
#+begin_src emacs-lisp
(use-package sudo-edit
  :bind ("C-x C-S-f" . sudo-edit-find-file))
#+end_src
** Translation (reverso)
I like [[https://github.com/SqrtMinusOne/reverso.el][reverso]] since it's using [[https://github.com/magit/transient][transient]] to make interactive commands.
#+begin_src emacs-lisp
(use-package reverso
  :bind
  ("C-c r" . reverso)
  (:map org-mode-map
        ("C-x n r" . custom/org-reverso-grammar-subtree))
  :preface
  (defun custom/org-reverso-grammar-subtree ()
    "Narrows to the current subtree and uses `reverso-grammar-buffer'."
    (interactive)
    (org-narrow-to-subtree)
    (org-fold-show-all)
    (reverso-grammar-buffer)
    )
  :config (add-to-list 'meow-mode-state-list '(reverso-result-mode . normal)))
#+end_src
** Window/buffer management :ARCHIVE:
*** Buffer-move
This allows to easily move windows (splits) around.
#+begin_src emacs-lisp
(use-package buffer-move)
#+end_src
** Writeroom
[[https://github.com/joostkremers/writeroom-mode][Writeroom-mode]] makes a nice writing experience by making big margins and hiding almost everything.
#+begin_src emacs-lisp
(use-package writeroom-mode
  :unless (custom/termux-p))
#+end_src
** display-buffer-alist
This variable desribes the way chosen buffers are displaying and behaving.
#+begin_src emacs-lisp
(defun custom/switch-to-buffer-other-window-for-alist (window)
  "Kind of `switch-to-buffer-other-window' but can be used in `display-buffer-alist' with body-function parameter."
  (select-window window))

(setq display-buffer-alist
      '(
        ;; ("^\\*helpful"
        ;;  (display-buffer--maybe-at-bottom)
        ;;  (window-height . 12)
        ;;  (dedicated . t))
        ;; ("\\*Help\\*"
        ;;  (display-buffer--maybe-at-bottom)
        ;;  (window-height . 12)
        ;;  ;; (dedicated . t)
        ;;  (body-function . custom/switch-to-buffer-other-window-for-alist))

        ("^CAPTURE"
         (display-buffer--maybe-at-bottom)
         (window-height . 12))
        (" \\*Agenda Commands\\*"
         (display-buffer--maybe-at-bottom)
         (window-height . 12)
         (window-parameters . ((mode-line-format . none))))
        ("\\*Org Select\\*"
         (display-buffer--maybe-at-bottom)
         (window-height . 12))
        ("\\*Org Links\\*"
         (display-buffer--maybe-at-bottom)
         (window-height . 1)
         (window-parameters . ((mode-line-format . none))))
        ("\\*Org todo\\*"
         (display-buffer--maybe-at-bottom)
         (window-parameters . ((mode-line-format . none))))
        ("\\*Org Babel Results\\*"
         (display-buffer--maybe-at-bottom))
        ("\\*org-roam\\*"
         (display-buffer-in-direction)
         (direction . right)
         (window-width . 0.33)
         (window-height . fit-window-to-buffer))

        ("\\*compilation\\*"
         ;; (display-buffer--maybe-at-bottom)
         (display-buffer-below-selected)
         (window-height . 12)
         ;; (dedicated . t)
         (body-function . custom/switch-to-buffer-other-window-for-alist))
        ("\\*Compile-log\\*"
         (display-buffer--maybe-at-bottom)
         (window-height . 12)
         (body-function . custom/switch-to-buffer-other-window-for-alist))

        ("\\*which-key\\*"
         (window-parameters . ((mode-line-format . none))))

        ("\\*Messages\\*"
         (display-buffer--maybe-at-bottom)
         (window-height . 12)
         (dedicated . t)
         (body-function . custom/switch-to-buffer-other-window-for-alist))
        ("\\*Backtrace\\*"
         (display-buffer--maybe-at-bottom)
         (window-height . 12)
         (dedicated . t)
         (body-function . custom/switch-to-buffer-other-window-for-alist))
        ("\\*Warnings\\*"
         (display-buffer--maybe-at-bottom)
         (window-height . 12)
         (dedicated . t)
         (body-function . custom/switch-to-buffer-other-window-for-alist))
        ;; ("\\*Async Shell Command\\*"
        ;;  (display-buffer--maybe-at-bottom)
        ;;  (window-height . 12)
        ;;  (dedicated . t)
        ;;  (body-function . custom/switch-to-buffer-other-window-for-alist))
        )

      switch-to-buffer-obey-display-actions t ; `switch-to-buffer' will respect `display-buffer-alist'
      switch-to-buffer-in-dedicated-window t) ; `switch-to-buffer' will work on dedicated window
#+end_src
** M3U mode
A mode for m3u files
#+begin_src emacs-lisp
(define-generic-mode
    'm3u-mode                      ;; name of the mode to create
  '("#")                         ;; comments start with '#'
  nil                            ;; keywords (none in this case)
  '(("^#EXTINF" . 'font-lock-keyword-face) ;; highlight #EXTINF as keyword
    ("\\.[A-Za-z0-9_]*$" . 'font-lock-string-face)) ;; highlight file extensions as strings
  '("\\.m3u\\'")                 ;; files for which to activate this mode
  nil                            ;; other functions to call
  "A mode for M3U playlist files") ;; doc string for this mode
#+end_src
